
## :white_check_mark: Apply Succeeded

[CI link](https://github.com/NaokiYazawa/bined-infra/actions/runs/5706803730)



<pre><code>Apply complete! Resources: 7 added, 0 changed, 0 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
Acquiring state lock. This may take a few moments...
module.network.aws_vpc.this[0]: Refreshing state... [id=vpc-0a20ed93f94539036]
module.network.aws_default_network_acl.this[0]: Refreshing state... [id=acl-02f2e05642c4a4f10]
module.network.aws_default_route_table.default[0]: Refreshing state... [id=rtb-05c8ef1ecd42c0a1c]
module.network.aws_default_security_group.this[0]: Refreshing state... [id=sg-0e49e03a5db24049b]
module.network.aws_route_table.public[0]: Refreshing state... [id=rtb-0100ed7567dfa4692]
module.network.aws_internet_gateway.this[0]: Refreshing state... [id=igw-04d47fac8f245bf03]
module.network.aws_route_table.private[0]: Refreshing state... [id=rtb-0bb4120b65c92a107]
module.network.aws_subnet.private[0]: Refreshing state... [id=subnet-0f0bc25f4fe692b9f]
module.network.aws_subnet.private[1]: Refreshing state... [id=subnet-04e257e755c87b631]
module.network.aws_subnet.database[0]: Refreshing state... [id=subnet-06e0f4cbee44e1b7e]
module.network.aws_subnet.database[1]: Refreshing state... [id=subnet-012d2f4ea363148d7]
module.network.aws_subnet.public[1]: Refreshing state... [id=subnet-0824e210311fe3361]
module.network.aws_subnet.public[0]: Refreshing state... [id=subnet-06e4b653ba82a0dbb]
module.network.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0e5ff3a153cc05fb7]
module.network.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-09c3069fee8860280]
module.network.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0dc75306fafe9d656]
module.network.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0100ed7567dfa46921080289494]
module.network.aws_route_table_association.database[0]: Refreshing state... [id=rtbassoc-0c5f41ee2056851dc]
module.network.aws_db_subnet_group.database[0]: Refreshing state... [id=bined-hasura]
module.network.aws_route_table_association.database[1]: Refreshing state... [id=rtbassoc-02aab784abc51b12a]
module.network.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0ff62e3874f25450b]
module.network.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0970af91d0fee328c]
module.network.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0dc82545eb07c4ac9]
module.network.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0bb4120b65c92a1071080289494]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.security_groups.aws_security_group.alb will be created
  + resource "aws_security_group" "alb" {
      + arn                    = (known after apply)
      + description            = "For ALB."
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow all to outbound."
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow HTTP from ALL."
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
        ]
      + name                   = "alb-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = "vpc-0a20ed93f94539036"
    }

  # module.security_groups.aws_security_group.bastion will be created
  + resource "aws_security_group" "bastion" {
      + arn                    = (known after apply)
      + description            = "For Bastion."
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow all to outbound."
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "3.112.23.0/29",
                ]
              + description      = "Allow SSH from ALL."
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
            },
        ]
      + name                   = "bastion-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = "vpc-0a20ed93f94539036"
    }

  # module.security_groups.aws_security_group.ecs will be created
  + resource "aws_security_group" "ecs" {
      + arn                    = (known after apply)
      + description            = "For ECS."
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow all to outbound."
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "ecs-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = "vpc-0a20ed93f94539036"
    }

  # module.security_groups.aws_security_group.rds will be created
  + resource "aws_security_group" "rds" {
      + arn                    = (known after apply)
      + description            = "For RDS."
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow all to outbound."
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "rds-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = "vpc-0a20ed93f94539036"
    }

  # module.security_groups.aws_security_group_rule.ecs_from_alb will be created
  + resource "aws_security_group_rule" "ecs_from_alb" {
      + description              = "Allow Application port from Security Group for ALB."
      + from_port                = 8080
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 8080
      + type                     = "ingress"
    }

  # module.security_groups.aws_security_group_rule.rds_from_bastion will be created
  + resource "aws_security_group_rule" "rds_from_bastion" {
      + description              = "Allow SSH port from Security Group for Bastion."
      + from_port                = 5432
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 5432
      + type                     = "ingress"
    }

  # module.security_groups.aws_security_group_rule.rds_from_ecs will be created
  + resource "aws_security_group_rule" "rds_from_ecs" {
      + description              = "Allow RDS port from Security Group for ECS."
      + from_port                = 5432
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 5432
      + type                     = "ingress"
    }

Plan: 7 to add, 0 to change, 0 to destroy.
module.security_groups.aws_security_group.bastion: Creating...
module.security_groups.aws_security_group.alb: Creating...
module.security_groups.aws_security_group.ecs: Creating...
module.security_groups.aws_security_group.rds: Creating...
module.security_groups.aws_security_group.ecs: Creation complete after 4s [id=sg-0ff51e5c4d89f1d35]
module.security_groups.aws_security_group.rds: Creation complete after 4s [id=sg-083bcb1f25b19e7ec]
module.security_groups.aws_security_group_rule.rds_from_ecs: Creating...
module.security_groups.aws_security_group.alb: Creation complete after 4s [id=sg-0ecb9e4d622873720]
module.security_groups.aws_security_group_rule.ecs_from_alb: Creating...
module.security_groups.aws_security_group.bastion: Creation complete after 4s [id=sg-0f8380f49f5c0ad42]
module.security_groups.aws_security_group_rule.rds_from_bastion: Creating...
module.security_groups.aws_security_group_rule.rds_from_ecs: Creation complete after 1s [id=sgrule-3456404465]
module.security_groups.aws_security_group_rule.ecs_from_alb: Creation complete after 1s [id=sgrule-2400929530]
module.security_groups.aws_security_group_rule.rds_from_bastion: Creation complete after 2s [id=sgrule-2433012620]
Releasing state lock. This may take a few moments...

Apply complete! Resources: 7 added, 0 changed, 0 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform","PRNumber":3,"Program":"tfcmt","SHA1":"6b7a0e40236e94d4b9d02b41fd7b0e39975aff75","Vars":{},"WorkflowName":"Terraform"} -->